// Домашнее задание 5
public class Main {

// Условия задания 5.

    public static void main(String[] args) {

    /* 1).Создать двухмерный массив из целых чисел.
          С помощью циклов "пройти" по всему массиву и увеличить каждый
          элемент на заданное число. Пусть число, на которое будет
          увеличиваться каждый элемент, задается из консоли. */
          createA2DArray();
          System.out.println();

    /* 2).Шахматная доска
          Создать программу для раскраски шахматной доски с помощью цикла.
          Создать двумерный массив String'ов 8х8. С помощью циклов задать
          элементам циклам значения B(Black) или W(White). Результат работы
          программы:
          W B W B W B W B
          B W B W B W B W
          W B W B W B W B
          B W B W B W B W
          W B W B W B W B
          B W B W B W B W
          W B W B W B W B
          B W B W B W B W */
          createAChessboard();
    }

// Решение задания 5.

    /* 1).Создать двухмерный массив из целых чисел.
          С помощью циклов "пройти" по всему массиву и увеличить каждый
          элемент на заданное число. Пусть число, на которое будет
          увеличиваться каждый элемент, задается из консоли. */
    private static void createA2DArray() {

    }

    /* 2).Шахматная доска
          Создать программу для раскраски шахматной доски с помощью цикла.
          Создать двумерный массив String'ов 8х8. С помощью циклов задать
          элементам циклам значения B(Black) или W(White). Результат работы
          программы:
          W B W B W B W B
          B W B W B W B W
          W B W B W B W B
          B W B W B W B W
          W B W B W B W B
          B W B W B W B W
          W B W B W B W B
          B W B W B W B W */
    private static void createAChessboard(){

    }
}



