// Домашнее задание 4.
public class Main {
    public static void main(String[] args) {

    /* 0). Создайте массив целых чисел. Напишете программу, которая выводит
           сообщение о том, входит ли заданное число в массив или нет. Пусть
           число для поиска задается с консоли (класс Scanner). */
        enteringANumberIntoAnArray();
        System.out.println();

    /* 1). Создайте массив целых чисел. Удалите все вхождения
          заданного числа из массива.
          Пусть число задается с консоли (класс Scanner). Если такого числа нет
        - выведите сообщения об этом.
          В результате должен быть новый массив без указанного числа. */
        showThatThereIsNoNumber();
        System.out.println();

    /* 2). Создайте и заполните массив случайным числами и выведете
          максимальное, минимальное и среднее значение.
          Для генерации случайного числа используйте метод Math.random().
          Пусть будет возможность создавать массив произвольного
          размера. Пусть размер массива вводится с консоли. */
        generateRandomNumber();
        System.out.println();

     /* 3). Создайте 2 массива из 5 чисел.
           Выведите массивы на консоль в двух отдельных строках.
           Посчитайте среднее арифметическое элементов каждого массива и
           сообщите, для какого из массивов это значение оказалось больше (либо
           сообщите, что их средние арифметические равны). */
        subtractTheArithmeticMean();


    }

    /* 0). Создайте массив целых чисел. Напишете программу, которая выводит
           сообщение о том, входит ли заданное число в массив или нет. Пусть
           число для поиска задается с консоли (класс Scanner). */
    static void enteringANumberIntoAnArray() {

    }

    /* 1). Создайте массив целых чисел. Удалите все вхождения
          заданного числа из массива.
          Пусть число задается с консоли (класс Scanner). Если такого числа нет
        - выведите сообщения об этом.
          В результате должен быть новый массив без указанного числа. */
    static void showThatThereIsNoNumber() {
    }

    /* 2). Создайте и заполните массив случайным числами и выведете
          максимальное, минимальное и среднее значение.
          Для генерации случайного числа используйте метод Math.random().
          Пусть будет возможность создавать массив произвольного
          размера. Пусть размер массива вводится с консоли. */

    static void generateRandomNumber() {
    }

    /* 3). Создайте 2 массива из 5 чисел.
           Выведите массивы на консоль в двух отдельных строках.
           Посчитайте среднее арифметическое элементов каждого массива и
           сообщите, для какого из массивов это значение оказалось больше (либо
           сообщите, что их средние арифметические равны). */

    static void subtractTheArithmeticMean() {
    }

}


















